src/DataProcessors/ИзменениеВидовКанбанов/ИзменениеВидовКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИзменениеВидовКанбанов</name>
  <attributes>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанбана</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанбанаНовый</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/ИзменениеВидовКанбанов/Forms/Форма/Module.bsl
&НаСервере
Процедура ИзменитьНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Родитель
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.Канбан = &Канбан";
Запрос.УстановитьПараметр("Родитель", Объект.ГруппаНоменклатуры);
Запрос.УстановитьПараметр("Канбан", Объект.ВидКанбана);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Номен = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Номен.Канбан = Объект.ВидКанбанаНовый;
	Номен.Записать();
	Сообщить(СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.Наименование)+" - изменен вид канбана!");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ИзменитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ГруппаНоменклатуры") Тогда
	Объект.ГруппаНоменклатуры = ЭтаФорма.Параметры.ГруппаНоменклатуры;
	КонецЕсли; 
КонецПроцедуры
